tomaszlanger/pic24fStarterKit/src/PIC24F Starter Kit 1/TouchSense.c
/******************************************************************************

    Capacitive Touch Sense

Description:
    This file contains the capacitive touch sensing routines for the PIC24F
    Starter Kit.  The CTMU (Charge Time Measurement Unit) is used for the
    capacitive touch switches.  The five switches are simply copper pads on the
    top layer of the printed circuit board.  The CTMU measures the relative
    capacitance of the switches in conjunction with the A/D converter.  The
    CTMU contains a constant current source, which linearly charges the
    capacitive switch with respect to time.  The amount of time the switch is
    charged is fixed, so that the voltage on the switch is constant as long as
    the switch remains unchanged.  When the switch is pressed, the capacitance
    of the human body is added in parallel with the capacitance of the switch.
    Since the charging time is fixed, the new larger capacitance results in a
    lower voltage read by the A/D.  Additional averaging of the A/D readings
    is done to smooth out the readings.

    Each switch reading is comprised of first draining all charge from the
    circuit by grounding the switch through a grounding function of the CTMU.
    This assures the charge on the circuit starts at 0 Volts.  The CTMU then
    charges the switch for a fixed amount of time, stops, and signals the A/D
    converter to make a conversion.  The voltage read is stored for use by the
    routine checking for button presses.  The switch is then discharged again,
    to make sure no leakage occurs to other switches located nearby.

Summary:
    This file contains the capacitive touch sensing routines for the PIC24F
    Starter Kit.

Remarks:
    This routine by default provides simple press/release messages for the
    individual buttons.  A more sophisticated use of the touchpads is gesture
    detection. This requires a state machine, since the touchpad history is
    required.  A preliminary version of gesture detection is provided.  To
    enable it, uncomment the #define USE_GESTURES line in HardwareProfile.h.

    The current implementation does not produce repetative touch messages
    (press-release combinations) when a touchpad is held.  A state machine is
    also required to do this.  To enable the state machine for repetative
    button presses but not gestures, uncomment the
    #define USE_TOUCHPAD_STATE_MACHINE line in HardwareProfile.h.
*******************************************************************************/
//DOM-IGNORE-BEGIN
/******************************************************************************

* File Name:       TouchSense.c
* Dependencies:    See the #include files below
* Processor:       PIC24F
* Compiler:        C30 v3.02c
* Company:         Microchip Technology, Inc.

Software License Agreement

The software supplied herewith by Microchip Technology Incorporated
(the “Company”) for its PICmicro® Microcontroller is intended and
supplied to you, the Company’s customer, for use solely and
exclusively on Microchip PICmicro Microcontroller products. The
software is owned by the Company and/or its supplier, and is
protected under applicable copyright laws. All rights are reserved.
Any use in violation of the foregoing restrictions may subject the
user to criminal sanctions under applicable laws, as well as to
civil liability for the breach of the terms and conditions of this
license.

THIS SOFTWARE IS PROVIDED IN AN “AS IS” CONDITION. NO WARRANTIES,
WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.

Author          Date    Comments
--------------------------------------------------------------------------------
KO          14-Feb-2008 First release

*******************************************************************************/
//DOM-IGNORE-END

#include <p24Fxxxx.h>
#include "PIC24F Starter Kit.h"

//******************************************************************************
//******************************************************************************
// Constants and Enumerations
//******************************************************************************
//******************************************************************************

// CTMU Constants

#define CTMU_OFF                        0x0000
#define CTMU_CONTINUE_IN_IDLE           0x0000
#define CTMU_EDGE_DELAY_DISABLED        0x0000
#define CTMU_EDGES_BLOCKED              0x0000
#define CTMU_NO_EDGE_SEQUENCE           0x0000
#define CTMU_CURRENT_NOT_GROUNDED       0x0000
#define CTMU_TRIGGER_OUT_DISABLED       0x0000
#define CTMU_EDGE2_NEGATIVE             0x0000
#define CTMU_EDGE2_CTED1                0x0060
#define CTMU_EDGE2_CTED2                0x0040
#define CTMU_EDGE1_POSITIVE             0x0010
#define CTMU_EDGE1_CTED1                0x000C
#define CTMU_EDGE1_CTED2                0x0008

#define CTMU_EDGE_MASK                  0x0003
#define CTMU_EDGE2                      0x0002
#define CTMU_EDGE1                      0x0001

#define AVG_DELAY                       64 //1 
#if defined TOUCHPAD_DIRECT_TOUCH
	#define CHARGE_TIME_COUNT           90 //34 // If optimized, this value must change.
#else
	#define CHARGE_TIME_COUNT           6 //34 // If optimized, this value must change.
	#define NUM_CTMU_READS				16
#endif

// State Machine Constants

#define MESSAGE_FIFO_SIZE               3
#define PRESS_REPEAT_TIME_FIRST         (1000 / MILLISECONDS_PER_TICK)        // one quarter second
#define PRESS_REPEAT_TIME_SUBSEQUENT    (500 / MILLISECONDS_PER_TICK)        // one eighth second
#define COMBO_WAIT_TIME                 (200 / MILLISECONDS_PER_TICK)


typedef enum {
    TOUCHPAD1 = 0,
    TOUCHPAD2,
    TOUCHPAD3,
    TOUCHPAD4,
    TOUCHPAD5,
    TOUCHPAD_NONE
} TOUCHPAD;

