tomaszlanger/pic24fStarterKit/src/PIC24F Starter Kit 1/TouchSense.c
typedef enum {
    TOUCHPAD_NONE_MASK    = 0,
    TOUCHPAD1_MASK        = 0x01,
    TOUCHPAD2_MASK        = 0x02,
    TOUCHPAD3_MASK        = 0x04,
    TOUCHPAD4_MASK        = 0x08,
    TOUCHPAD5_MASK        = 0x10
} TOUCHPAD_MASK;

#define TOUCHPAD_ALL_BUTTONS_MASK   (TOUCHPAD1_MASK | TOUCHPAD2_MASK | TOUCHPAD3_MASK | TOUCHPAD4_MASK | TOUCHPAD5_MASK )

typedef enum {
    STATE_START = 0,
    STATE_FIRST_PRESS,
    STATE_SEND_RELEASED_REPEAT,
    STATE_SEND_PRESSED,
    STATE_NEXT_PRESS_WAIT,
    STATE_SEND_RELEASED,
#ifdef USE_GESTURES
    STATE_SWEEP,
    STATE_NEXT_SWEEP_WAIT,
    STATE_SEND_SWEEP_PRESSED,
    STATE_SWEEP_WAIT,
    STATE_SEND_SWEEP_RELEASED,
    STATE_SEND_CW,
    STATE_CW_HOLD,
    STATE_SEND_CCW,
    STATE_CCW_HOLD
#endif
} TOUCHPAD_STATES;


//******************************************************************************
//******************************************************************************
// Data Structures
//******************************************************************************
//******************************************************************************

typedef union
{
    struct
    {
        unsigned    BTN1:1;
        unsigned    BTN2:1;
        unsigned    BTN3:1;
        unsigned    BTN4:1;
        unsigned    BTN5:1;
    };
    WORD            val;
} TOUCHPADS;


//******************************************************************************
//******************************************************************************
// Variables
//******************************************************************************
//******************************************************************************

TOUCHPADS                   buttons;
extern SCREEN_STATES        screenState;

unsigned int                rawCTMU[NUM_TOUCHPADS];       //raw A/D value
unsigned int                average[NUM_TOUCHPADS];       //averaged A/D value
unsigned int                trip   [NUM_TOUCHPADS];       //trip point for TOUCHPAD
unsigned int                hyst   [NUM_TOUCHPADS];       //hysterisis for TOUCHPAD

unsigned char               first;                  // first variable to 'discard' first N samples
unsigned char               buttonIndex;                    // Index of what TOUCHPAD is being checked.

unsigned int                value;                  // current button value
unsigned int                bigVal;                 // current button bigval
unsigned int                smallAvg;               // current button smallavg
unsigned int                AvgIndex;

#ifdef USE_TOUCHPAD_STATE_MACHINE

    TOUCHPAD_STATES     currentState;
    WORD                lastPressedButtonMask;
    WORD                messageFIFO1[MESSAGE_FIFO_SIZE+1];
    WORD                messageFIFO2[MESSAGE_FIFO_SIZE+1];
    WORD                messageFIFOHead;
    WORD                messageFIFOTail;
    DWORD               buttonTime;
    DWORD               buttonTimeStart;
    WORD                repeatInterval;
    TOUCHPAD            startingButton;

    WORD                buttonPressedMessages[] = { SCAN_UP_PRESSED,  SCAN_RIGHT_PRESSED,  SCAN_DOWN_PRESSED,  SCAN_LEFT_PRESSED,  SCAN_CR_PRESSED };
    WORD                buttonReleasedMessages[]= { SCAN_UP_RELEASED, SCAN_RIGHT_RELEASED, SCAN_DOWN_RELEASED, SCAN_LEFT_RELEASED, SCAN_CR_RELEASED };

    WORD                sweepPressedMessages[]  = { SCAN_PGDOWN_PRESSED,  SCAN_HOME_PRESSED,  SCAN_PGUP_PRESSED,  SCAN_END_PRESSED };
    WORD                sweepReleasedMessages[] = { SCAN_PGDOWN_RELEASED, SCAN_HOME_RELEASED, SCAN_PGUP_RELEASED, SCAN_END_RELEASED };

    TOUCHPAD_MASK       tableFirstPressTrans1[] = { TOUCHPAD1_MASK, TOUCHPAD2_MASK, TOUCHPAD3_MASK, TOUCHPAD4_MASK, TOUCHPAD5_MASK };
    #define tableFirstPressTrans2           tableFirstPressTrans1
    #define tableFirstPressTrans3           tableFirstPressTrans1

    TOUCHPAD_MASK       tableNextPressTrans1[]  = { TOUCHPAD5_MASK, TOUCHPAD5_MASK, TOUCHPAD5_MASK, TOUCHPAD5_MASK, TOUCHPAD_NONE_MASK };
    TOUCHPAD_MASK       tableNextPressTrans2[]  = { TOUCHPAD2_MASK, TOUCHPAD3_MASK, TOUCHPAD4_MASK, TOUCHPAD1_MASK, TOUCHPAD_NONE_MASK };
    TOUCHPAD_MASK       tableNextPressTrans3[]  = { TOUCHPAD4_MASK, TOUCHPAD1_MASK, TOUCHPAD2_MASK, TOUCHPAD3_MASK, TOUCHPAD_NONE_MASK };
    #define tableNextPressTrans4            tableFirstPressTrans1
    #define tableNextPressTrans5            tableFirstPressTrans1

#ifdef USE_GESTURES
    #define tableSweepTrans1                tableNextPressTrans1

    TOUCHPAD_MASK       tableNextSweepTrans1[]  = { TOUCHPAD3_MASK, TOUCHPAD4_MASK, TOUCHPAD1_MASK, TOUCHPAD2_MASK };

    #define tableSweepWaitTrans1            tableNextSweepTrans1

    #define tableSpinCWHoldTrans1           tableNextPressTrans2

    #define tableSpinCCWHoldTrans1          tableNextPressTrans3
#endif

#else

    TOUCHPADS       buttonsPrevious;

#endif

//******************************************************************************
//******************************************************************************
// Macros
//******************************************************************************
//******************************************************************************

#define FIFOEmpty()         (messageFIFOHead == messageFIFOTail)
#define FIFOFull()          (messageFIFOHead == 0 ?                         \
                                (messageFIFOTail == MESSAGE_FIFO_SIZE-1) :  \
                                (messageFIFOTail == messageFIFOHead - 1))
#define FIFODequeue(x,y)    {                                               \
                                x = messageFIFO1[messageFIFOHead];          \
                                y = messageFIFO2[messageFIFOHead];          \
                                messageFIFOHead++;                          \
                                if (messageFIFOHead == MESSAGE_FIFO_SIZE) messageFIFOHead = 0;  \
                            }

#define FIFOEnqueue(x,y)    {                                               \
                                messageFIFO1[messageFIFOTail] = x;          \
                                messageFIFO2[messageFIFOTail] = y;          \
                                messageFIFOTail++;                          \
                                if (messageFIFOTail == MESSAGE_FIFO_SIZE) messageFIFOTail = 0;  \
                            }

