tomaszlanger/pic24fStarterKit/src/PIC24F Starter Kit 1/TouchSense.c
//******************************************************************************
//******************************************************************************
// Local Prototypes
//******************************************************************************
//******************************************************************************

void GestureStateMachine( void );
void SetNextChannel(void);

/****************************************************************************
  Function:
    void CTMUInit( void )

  Description:
    This routine sets up the CTMU for capacitive touch sensing.

  Precondition:
    None

  Parameters:
    None

  Return Values:
    None

  Remarks:
    None
  ***************************************************************************/

void CTMUInit( void )
{
    int     i;

    #if defined USE_SH1101A
        TRISB    = 0x1F01;     //RB0, RB8, RB9, RB10, RB11, RB12 Tri-state - used by A/D for CTMU/POT
        AD1PCFGL &= ~0x1F01;
    #elif defined USE_SSD1303
        TRISB    = 0x0F01;     //RB0, RB9, RB10, RB11, RB12 Tri-state - used by A/D for CTMU/POT
        AD1PCFGL &= ~0x0F01;
    #endif

    // Set up the CTMU

    CTMUCON =   CTMU_OFF                    |
                CTMU_CONTINUE_IN_IDLE       |
                CTMU_EDGE_DELAY_DISABLED    |
                CTMU_EDGES_BLOCKED          |
                CTMU_NO_EDGE_SEQUENCE       |
                CTMU_CURRENT_NOT_GROUNDED   |
                CTMU_TRIGGER_OUT_DISABLED   |
                CTMU_EDGE2_NEGATIVE         |
                CTMU_EDGE2_CTED1            |
                CTMU_EDGE1_POSITIVE         |
                CTMU_EDGE1_CTED1;

    #if defined TOUCHPAD_DIRECT_TOUCH
        CTMUICONbits.IRNG   = 2;        // 5.5uA
    #else
        CTMUICONbits.IRNG   = 3;        // 55uA
    #endif
    CTMUICONbits.ITRIM  = 0;        // 0%

    // Set up the ADC

////    AD1PCFG             = 0x0000;
    AD1CON1             = 0x0000;
    AD1CHS              = STARTING_ADC_CHANNEL; // Select the starting analog channel
    AD1CSSL             = 0x0000;
    AD1CON1bits.FORM    = 0x0;                  // Unsigned integer format
    AD1CON3             = 0x0002;
    AD1CON2             = 0x0000;
    AD1CON1bits.ADON    = 1;                    // Start A/D in continuous mode

    // Enable the CTMU

    CTMUCONbits.CTMUEN  = 1;

    // Initialize Capacitive Sensing

    for (i = 0; i < NUM_TOUCHPADS; i++ )
    {
        trip[i]         = TRIP_VALUE;
        hyst[i]         = HYSTERESIS_VALUE;
        // rawCTMU[] and average[] arrays are initialized to 0 by definition
    }

    buttonIndex         = 0;
    first               = 160;          // First pass flag to reach steady state average before enabling detection
}


/****************************************************************************
  Function:
    void GestureStateMachine( void )

  Description:
    *** PRELIMINARY ***
    This function implements a state machine to determine gestures on the
    touchpads.  This state machine allows us to:
        * Set repetative RELEASE/TOUCHED messages when holding the touchpad
            for a long period of time.
        * Detect sweeps up (PAGE UP), down (PAGE DOWN), left (HOME), and
            right (END).
        * Detect clockwise and counterclockwise spins.

  Precondition:
    None

  Parameters:
    None

  Return Values:
    None

  Remarks:
    This routine is only used if the compile time switch
    USE_TOUCHPAD_STATE_MACHINE is defined.  To enable all gesture detection,
    the compile time switch USE_GESTURES must be defined.

    *** This routine has not been fully tested. ***
  ***************************************************************************/

#ifdef USE_TOUCHPAD_STATE_MACHINE

void GestureStateMachine( void )
{
    BOOL    done = FALSE;

    while (!done)
    {
        switch (currentState)
        {
            case STATE_START:
                buttonTimeStart         = tick;
                repeatInterval          = PRESS_REPEAT_TIME_FIRST;
                lastPressedButtonMask   = TOUCHPAD_NONE;

                if (buttons.BTN1)
                {
                    startingButton      = TOUCHPAD1;
                    currentState        = STATE_FIRST_PRESS;
                }
                else if (buttons.BTN2)
                {
                    startingButton      = TOUCHPAD2;
                    currentState        = STATE_FIRST_PRESS;
                }
                else if (buttons.BTN3)
                {
                    startingButton      = TOUCHPAD3;
                    currentState        = STATE_FIRST_PRESS;
                }
                else if (buttons.BTN4)
                {
                    startingButton      = TOUCHPAD4;
                    currentState        = STATE_FIRST_PRESS;
                }
                else if (buttons.BTN5)
                {
                    startingButton      = TOUCHPAD5;
                    currentState        = STATE_FIRST_PRESS;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_FIRST_PRESS:
                buttonTime              = tick - buttonTimeStart;
                if (!(buttons.val & tableFirstPressTrans1[startingButton]))
                {
                    currentState        = STATE_NEXT_PRESS_WAIT;
                    buttonTimeStart     = tick;
                    done                = TRUE;
                }
                else if ((buttons.val & tableFirstPressTrans2[startingButton]) &&
                            ((tick-buttonTimeStart) > repeatInterval))
                {
                    if (lastPressedButtonMask == startingButton)
                    {
                        currentState    = STATE_SEND_RELEASED_REPEAT;
                    }
                    else
                    {
                        currentState    = STATE_SEND_PRESSED;
                    }
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_SEND_RELEASED_REPEAT:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, buttonReleasedMessages[startingButton] );
                }
                currentState            = STATE_SEND_PRESSED;
                break;

            case STATE_SEND_PRESSED:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, buttonPressedMessages[startingButton] );
                }
                buttonTimeStart         = tick;
                lastPressedButtonMask   = startingButton;
                repeatInterval          = PRESS_REPEAT_TIME_SUBSEQUENT;
                currentState            = STATE_START;
                done                    = TRUE;
                break;

            case STATE_NEXT_PRESS_WAIT:
                buttonTime              = tick - buttonTimeStart;
                #ifdef USE_GESTURES
                if (buttons.val & tableNextPressTrans1[startingButton])
                {
                    currentState        = STATE_SWEEP;
                    done                = TRUE;
                }
                else if (buttons.val & tableNextPressTrans2[startingButton])
                {
                    currentState        = STATE_SEND_CW;
                }
                else if (buttons.val & tableNextPressTrans3[startingButton])
                {
                    currentState        = STATE_SEND_CCW;
                }
                else
                #endif
                if (buttons.val & tableNextPressTrans4[startingButton])
                {
                    currentState        = STATE_FIRST_PRESS;
                    buttonTimeStart     = tick;
                    done                = TRUE;
                }
                else if (!(buttons.val & tableNextPressTrans5[startingButton]) &&
                            ((tick-buttonTimeStart) > COMBO_WAIT_TIME))
                {
                    currentState        = STATE_SEND_RELEASED;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_SEND_RELEASED:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, buttonReleasedMessages[startingButton] );
                }
                currentState            = STATE_START;
                done                    = TRUE;
                break;

#ifdef USE_GESTURES

