tomaszlanger/pic24fStarterKit/src/PIC24F Starter Kit 1/TouchSense.c
            case STATE_SWEEP:
                if (buttons.val & tableSweepTrans1[startingButton])
                {
                    currentState        = STATE_NEXT_SWEEP_WAIT;
                    buttonTimeStart     = tick;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_NEXT_SWEEP_WAIT:
                buttonTime = tick - buttonTimeStart;
                if (buttons.val & tableNextSweepTrans1[startingButton])
                {
                    currentState        = STATE_SEND_SWEEP_PRESSED;
                }
                else if (((buttons.val & ~tableNextSweepTrans1[startingButton]) & TOUCHPAD_ALL_BUTTONS_MASK) ||
                            ((tick-buttonTimeStart) > COMBO_WAIT_TIME))
                {
                    currentState        = STATE_START;
                    done                = TRUE;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_SEND_SWEEP_PRESSED:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, sweepPressedMessages[startingButton] );
                }
                currentState            = STATE_SWEEP_WAIT;
                done                    = TRUE;
                break;

            case STATE_SWEEP_WAIT:
                if (!(buttons.val & tableSweepWaitTrans1[startingButton]))
                {
                    currentState        = STATE_SEND_SWEEP_RELEASED;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_SEND_SWEEP_RELEASED:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, sweepReleasedMessages[startingButton] );
                }
                currentState            = STATE_START;
                break;

            case STATE_SEND_CW:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, SCAN_SPIN_CW );
                }
                currentState            = STATE_CW_HOLD;
                break;

            case STATE_CW_HOLD:
                if (!(buttons.val & tableSpinCWHoldTrans1[startingButton]))
                {
                    currentState        = STATE_START;
                }
                else
                {
                    done                = TRUE;
                }
                break;

            case STATE_SEND_CCW:
                if (!FIFOFull())
                {
                    FIFOEnqueue( ID_TOUCH_PAD, SCAN_SPIN_CCW );
                }
                currentState            = STATE_CCW_HOLD;
                break;

            case STATE_CCW_HOLD:
                if (!(buttons.val & tableSpinCCWHoldTrans1[startingButton]))
                {
                    currentState        = STATE_START;
                }
                else
                {
                    done                = TRUE;
                }
                break;

#endif

        }
    }
}
#endif


/****************************************************************************
  Function:
    void ReadCTMU( void )

  Description:
    Thi is the capacitive touch sensing service routine for CTMU.  It takes
    the measurement; determines if the button under test is pressed or not,
    setting a flag accordingly; and averages the new reading appropriately.
    This is done for all buttons sequentially.

  Precondition:
    None

  Parameters:
    None

  Return Values:
    None

  Remarks:
    To keep all A/D manipulation together, the Starter Kit's potentiometer is
    also read here if we are graphing or capturing.
  ***************************************************************************/

void ReadCTMU( void )
{
    int                     current_ipl;
    int                     i;
    int                     j;
#if defined TOUCHPAD_USE_OVERLAY
	int						k;
#endif
    volatile unsigned int   tempADch;
	extern SCREEN_STATES 	screenState;


    tempADch            = AD1CHS;      //store the current A/D mux channel selected

    AD1CON1             = 0x0000;       // Unsigned integer format
    AD1CSSL             = 0x0000;
    AD1CON3             = 0x0002;
    AD1CON2             = 0x0000;
    AD1CON1bits.ADON    = 1;            // Start A/D in continuous mode

    for(i = 0; i < NUM_TOUCHPADS; i++)
    {
        #if defined TOUCHPAD_USE_OVERLAY		
		for(k = 0; k < NUM_CTMU_READS; k++)
        #endif
		{
            // Get the raw sensor reading.
            AD1CHS                  = STARTING_ADC_CHANNEL + buttonIndex; //select A/D channel
    
            // Make sure touch circuit is completely discharged
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.DONE        = 0;
            AD1CON1bits.SAMP        = 1;        // Manually start sampling
            // Wait for the A/D converter to begin sampling
            Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();
            CTMUCONbits.IDISSEN     = 1;        // Drain any charge on the circuit
            Nop();    Nop();    Nop();    Nop();    Nop();
            CTMUCONbits.IDISSEN     = 0;
            Nop();    Nop();    Nop();    Nop();    Nop();
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.SAMP        = 0;		//Manually start conversion
            while(!IFS0bits.AD1IF);             // Wait for the A/D conversion to finish
                                                // Note: This A/D conversion not used.
                                                // A/D mux must connect to the channel
                                                // for CTMU to drain charge
    
            // Charge touch circuit
    
            // Since the charge is time dependent, set the CPU priority such
            // that we will not be interrupted during the read.
            SET_AND_SAVE_CPU_IPL( current_ipl, 7 );
    
            IFS0bits.AD1IF          = 0;
    
            AD1CON1bits.SAMP        = 1;        // Manually start sampling
            CTMUCONbits.EDG2STAT    = 0;        // Make sure edge2 is 0
            CTMUCONbits.EDG1STAT    = 1;        // Set edge1 - Start Charge
    
            for (j = 0; j < CHARGE_TIME_COUNT; j++);    // Delay for CTMU charge time
    
            CTMUCONbits.EDG1STAT    = 0;        // Clear edge1 - Stop Charge
    
            // Re-enable interrupts.
            RESTORE_CPU_IPL( current_ipl );
    
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.SAMP        = 0;
            while(!IFS0bits.AD1IF);             // Wait for the A/D conversion to finish
            #if defined TOUCHPAD_USE_OVERLAY
            	    value = value + ADC1BUF0; 			// Read the value from the A/D conversion
            #else
            		value = ADC1BUF0;
            #endif
    
            //Discharge the touch circuit
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.SAMP        = 1;        // Manually start sampling
    
            // Wait for A/D conversion to begin
            Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();
            CTMUCONbits.IDISSEN     = 1;        // Drain any charge on the circuit
            Nop();    Nop();    Nop();    Nop();    Nop();
            CTMUCONbits.IDISSEN     = 0;        // End charge drain
            Nop();    Nop();    Nop();    Nop();
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.SAMP        = 0;        // Perform conversion
            while(!IFS0bits.AD1IF);             // Wait for the A/D conversion to finish
            IFS0bits.AD1IF          = 0;
            AD1CON1bits.DONE        = 0;        // Note: The A/D conversion not used
                                                // A/D mux must connect to the channel
                                                // for CTMU to drain charge
            //End of CTMU read
		}
        #if defined TOUCHPAD_USE_OVERLAY
		    value = value/NUM_CTMU_READS;
        #endif

        #if defined TOUCHPAD_LO_PASS
		if (screenState == SCREEN_BLASTER)
        #endif
		{
    		// Allow greater sensitivity for the game Blaster.
		    bigVal                  = value  * 16; 
		}
        #if defined TOUCHPAD_LO_PASS
		else               
		{
    		// Integrate the raw values for better stability.
		    bigVal					= ((rawCTMU[buttonIndex]>>4)*7+value)<<1; 
		}    
        #endif  
        
        smallAvg                = average[buttonIndex]  / 16;   // smallAvg is the current average right shifted 4 bits
        rawCTMU[buttonIndex]    = bigVal;                       // raw array holds the most recent bigVal values

        // On power-up, reach steady-state readings

        if (first > 0)
        {
            first--;
            average[buttonIndex] = bigVal;
            SetNextChannel();
            break;
        }

        // Is a keypad button pressed or released?

