tomaszlanger/pic24fStarterKit/src/PIC24F Starter Kit 1/TouchSense.c
        if (bigVal < (average[buttonIndex] - trip[buttonIndex]))
        {
            // Pressed
            switch(buttonIndex)
            {
                case TOUCHPAD1:    buttons.BTN1  = 1;  break;
                case TOUCHPAD2:    buttons.BTN2  = 1;  break;
                case TOUCHPAD3:    buttons.BTN3  = 1;  break;
                case TOUCHPAD4:    buttons.BTN4  = 1;  break;
                case TOUCHPAD5:    buttons.BTN5  = 1;  break;
            }

        }
        else if (bigVal > (average[buttonIndex] - trip[buttonIndex] + hyst[buttonIndex]))
        {
            // Released
            switch(buttonIndex)
            {
                case TOUCHPAD1:    buttons.BTN1  = 0;  break;
                case TOUCHPAD2:    buttons.BTN2  = 0;  break;
                case TOUCHPAD3:    buttons.BTN3  = 0;  break;
                case TOUCHPAD4:    buttons.BTN4  = 0;  break;
                case TOUCHPAD5:    buttons.BTN5  = 0;  break;
            }
        }

        // Implement quick-release for a released button

        if (bigVal  > average[buttonIndex])
        {
            average[buttonIndex] = bigVal;                                      // If raw is above Average, reset to high average.
        }

        // Average in the new value.  Always Average (all buttons)
        // Counting 0..8 has effect of every 9th count cycling the next button.
        // Counting 0..4 will average faster and also can use 0..4*m, m=0,1,2,3..
	        if(buttonIndex == 0)
        {
            if (AvgIndex < AVG_DELAY)
            {
                AvgIndex++;
            }
            else
            {
                AvgIndex = 0;
            }
        }

        if (AvgIndex == AVG_DELAY)
        {
            // Average in raw value.
			
            average[buttonIndex] = average[buttonIndex] + (value - smallAvg);
        }

        // Determine next sensor to test.

        SetNextChannel();

    }

    if((screenState == SCREEN_GRAPH) || (screenState == SCREEN_CAPTURE))
    {
        // Read the potentiometer and store it for the demo.
        GraphReadPotentiometer();
    }

    #ifdef USE_TOUCHPAD_STATE_MACHINE
        GestureStateMachine();
    #endif

    AD1CHS = tempADch;  //restore A/D channel select
}


/****************************************************************************
  Function:
    void SetNextChannel( void )

  Description:
    This function sets the next channel in sequence to be scanned based off
    of the current index value.

  Precondition:
    None

  Parameters:
    None

  Return Values:
    None

  Remarks:
    None
  ***************************************************************************/

void SetNextChannel( void )
{
    buttonIndex++;
    if (buttonIndex == NUM_TOUCHPADS)
    {
        buttonIndex = 0;
    }
}


/****************************************************************************
  Function:
    void TouchSenseButtonsMsg(GOL_MSG* msg)

  Description:
    This routine creates approprite messages for button presses & releases.

  Precondition:
    None

  Parameters:
    GOL_MSG *msg    - The new system message

  Returns:
    None

  Remarks:
    If we are using the state machine to decode gestures, we just pull the
    message from the queue if the queue is not empty.  If we are not using
    gestures, then we look for a change in the state of a button.  If there
    has been a state change, we send a message.  Note that this means that
    repetative messages will not be generated if a touchpad is held for a
    long period of time.
  ***************************************************************************/

void TouchSenseButtonsMsg(GOL_MSG* msg)
{
    msg->uiEvent    = EVENT_INVALID;
    msg->type       = TYPE_KEYBOARD;

    #ifdef USE_TOUCHPAD_STATE_MACHINE

        if (!FIFOEmpty())
        {
            msg->uiEvent = EVENT_KEYSCAN;
            FIFODequeue( msg->param1, msg->param2 );
        }

    #else

        if (buttons.BTN1 != buttonsPrevious.BTN1)
        {
            msg->uiEvent = EVENT_KEYSCAN;
            msg->param1  = ID_TOUCH_PAD;            //ID_TOUCH_BUTTON_01;
            if (buttons.BTN1)
            {
                msg->param2  = SCAN_UP_PRESSED;     //SCAN_CR_PRESSED;
            }
            else
            {
                msg->param2  = SCAN_UP_RELEASED;    //SCAN_CR_RELEASED;
            }
            buttonsPrevious.BTN1 = buttons.BTN1;
            return;
        }

        if (buttons.BTN2 != buttonsPrevious.BTN2)
        {
            msg->uiEvent = EVENT_KEYSCAN;
            msg->param1  = ID_TOUCH_PAD;            //ID_TOUCH_BUTTON_02;
            if (buttons.BTN2)
            {
                msg->param2  = SCAN_RIGHT_PRESSED;  //SCAN_CR_PRESSED;
            }
            else
            {
                msg->param2  = SCAN_RIGHT_RELEASED; //SCAN_CR_RELEASED;
            }
            buttonsPrevious.BTN2 = buttons.BTN2;
            return;
        }

        if (buttons.BTN3 != buttonsPrevious.BTN3)
        {
            msg->uiEvent = EVENT_KEYSCAN;
            msg->param1  = ID_TOUCH_PAD;            //ID_TOUCH_BUTTON_03;
            if (buttons.BTN3)
            {
                msg->param2  = SCAN_DOWN_PRESSED;   //SCAN_CR_PRESSED;
            }
            else
            {
                msg->param2  = SCAN_DOWN_RELEASED;  //SCAN_CR_RELEASED;
            }
            buttonsPrevious.BTN3 = buttons.BTN3;
            return;
        }

        if (buttons.BTN4 != buttonsPrevious.BTN4)
        {
            msg->uiEvent = EVENT_KEYSCAN;
            msg->param1  = ID_TOUCH_PAD;            //ID_TOUCH_BUTTON_04;
            if (buttons.BTN4)
            {
                msg->param2  = SCAN_LEFT_PRESSED;   //SCAN_CR_PRESSED;
            }
            else
            {
                msg->param2  = SCAN_LEFT_RELEASED;  //SCAN_CR_RELEASED;
            }
            buttonsPrevious.BTN4 = buttons.BTN4;
            return;
        }

        if (buttons.BTN5 != buttonsPrevious.BTN5)
        {
            msg->uiEvent = EVENT_KEYSCAN;
            msg->param1  = ID_TOUCH_PAD;            //ID_TOUCH_BUTTON_05;
            if (buttons.BTN5)
            {
                msg->param2  = SCAN_CR_PRESSED;
            }
            else
            {
                msg->param2  = SCAN_CR_RELEASED;
            }
            buttonsPrevious.BTN5 = buttons.BTN5;
            return;
        }

    #endif
}



